zephyrproject-rtos/hal_nxp/dts/nxp/lpc/lpc55xxx/pinctrl/LPC5512JBD64-pinctrl.h
#undef DMA1_TRIG11_PIO1_13
#undef DMA1_TRIG11_PIO1_14
#undef DMA1_TRIG11_PIO1_15
#undef DMA1_TRIG11_PIO1_16
#undef DMA1_TRIG11_PIO1_17
#undef DMA1_TRIG11_PIO1_18
#undef DMA1_TRIG11_PIO1_19
#undef DMA1_TRIG11_PIO1_20
#undef DMA1_TRIG11_PIO1_21
#undef DMA1_TRIG11_PIO1_22
#undef DMA1_TRIG11_PIO1_23
#undef DMA1_TRIG11_PIO1_24
#undef DMA1_TRIG11_PIO1_25
#undef DMA1_TRIG11_PIO1_26
#undef DMA1_TRIG11_PIO1_27
#undef DMA1_TRIG11_PIO1_28
#undef DMA1_TRIG11_PIO1_29
#undef DMA1_TRIG11_PIO1_30
#undef DMA1_TRIG11_PIO1_31
#undef DMA1_TRIG11_PIO1_4
#undef DMA1_TRIG11_PIO1_5
#undef DMA1_TRIG11_PIO1_6
#undef DMA1_TRIG11_PIO1_7
#undef DMA1_TRIG11_PIO1_8
#undef DMA1_TRIG11_PIO1_9
#undef DMA1_TRIG12_PIO1_10
#undef DMA1_TRIG12_PIO1_11
#undef DMA1_TRIG12_PIO1_12
#undef DMA1_TRIG12_PIO1_13
#undef DMA1_TRIG12_PIO1_14
#undef DMA1_TRIG12_PIO1_15
#undef DMA1_TRIG12_PIO1_16
#undef DMA1_TRIG12_PIO1_17
#undef DMA1_TRIG12_PIO1_18
#undef DMA1_TRIG12_PIO1_19
#undef DMA1_TRIG12_PIO1_20
#undef DMA1_TRIG12_PIO1_21
#undef DMA1_TRIG12_PIO1_22
#undef DMA1_TRIG12_PIO1_23
#undef DMA1_TRIG12_PIO1_24
#undef DMA1_TRIG12_PIO1_25
#undef DMA1_TRIG12_PIO1_26
#undef DMA1_TRIG12_PIO1_27
#undef DMA1_TRIG12_PIO1_28
#undef DMA1_TRIG12_PIO1_29
#undef DMA1_TRIG12_PIO1_30
#undef DMA1_TRIG12_PIO1_31
#undef DMA1_TRIG12_PIO1_4
#undef DMA1_TRIG12_PIO1_5
#undef DMA1_TRIG12_PIO1_6
#undef DMA1_TRIG12_PIO1_7
#undef DMA1_TRIG12_PIO1_8
#undef DMA1_TRIG12_PIO1_9
#undef DMA1_TRIG13_PIO1_10
#undef DMA1_TRIG13_PIO1_11
#undef DMA1_TRIG13_PIO1_12
#undef DMA1_TRIG13_PIO1_13
#undef DMA1_TRIG13_PIO1_14
#undef DMA1_TRIG13_PIO1_15
#undef DMA1_TRIG13_PIO1_16
#undef DMA1_TRIG13_PIO1_17
#undef DMA1_TRIG13_PIO1_18
#undef DMA1_TRIG13_PIO1_19
#undef DMA1_TRIG13_PIO1_20
#undef DMA1_TRIG13_PIO1_21
#undef DMA1_TRIG13_PIO1_22
#undef DMA1_TRIG13_PIO1_23
#undef DMA1_TRIG13_PIO1_24
#undef DMA1_TRIG13_PIO1_25
#undef DMA1_TRIG13_PIO1_26
#undef DMA1_TRIG13_PIO1_27
#undef DMA1_TRIG13_PIO1_28
#undef DMA1_TRIG13_PIO1_29
#undef DMA1_TRIG13_PIO1_30
#undef DMA1_TRIG13_PIO1_31
#undef DMA1_TRIG13_PIO1_4
#undef DMA1_TRIG13_PIO1_5
#undef DMA1_TRIG13_PIO1_6
#undef DMA1_TRIG13_PIO1_7
#undef DMA1_TRIG13_PIO1_8
#undef DMA1_TRIG13_PIO1_9
#undef DMA1_TRIG14_PIO1_10
#undef DMA1_TRIG14_PIO1_11
#undef DMA1_TRIG14_PIO1_12
#undef DMA1_TRIG14_PIO1_13
#undef DMA1_TRIG14_PIO1_14
#undef DMA1_TRIG14_PIO1_15
#undef DMA1_TRIG14_PIO1_16
#undef DMA1_TRIG14_PIO1_17
#undef DMA1_TRIG14_PIO1_18
#undef DMA1_TRIG14_PIO1_19
#undef DMA1_TRIG14_PIO1_20
#undef DMA1_TRIG14_PIO1_21
#undef DMA1_TRIG14_PIO1_22
#undef DMA1_TRIG14_PIO1_23
#undef DMA1_TRIG14_PIO1_24
#undef DMA1_TRIG14_PIO1_25
#undef DMA1_TRIG14_PIO1_26
#undef DMA1_TRIG14_PIO1_27
#undef DMA1_TRIG14_PIO1_28
#undef DMA1_TRIG14_PIO1_29
#undef DMA1_TRIG14_PIO1_30
#undef DMA1_TRIG14_PIO1_31
#undef DMA1_TRIG14_PIO1_4
#undef DMA1_TRIG14_PIO1_5
#undef DMA1_TRIG14_PIO1_6
#undef DMA1_TRIG14_PIO1_7
#undef DMA1_TRIG14_PIO1_8
#undef DMA1_TRIG14_PIO1_9
#undef DMA1_TRIG15_PIO1_10
#undef DMA1_TRIG15_PIO1_11
#undef DMA1_TRIG15_PIO1_12
#undef DMA1_TRIG15_PIO1_13
#undef DMA1_TRIG15_PIO1_14
#undef DMA1_TRIG15_PIO1_15
#undef DMA1_TRIG15_PIO1_16
#undef DMA1_TRIG15_PIO1_17
#undef DMA1_TRIG15_PIO1_18
#undef DMA1_TRIG15_PIO1_19
#undef DMA1_TRIG15_PIO1_20
#undef DMA1_TRIG15_PIO1_21
#undef DMA1_TRIG15_PIO1_22
#undef DMA1_TRIG15_PIO1_23
#undef DMA1_TRIG15_PIO1_24
#undef DMA1_TRIG15_PIO1_25
#undef DMA1_TRIG15_PIO1_26
#undef DMA1_TRIG15_PIO1_27
#undef DMA1_TRIG15_PIO1_28
#undef DMA1_TRIG15_PIO1_29
#undef DMA1_TRIG15_PIO1_30
#undef DMA1_TRIG15_PIO1_31
#undef DMA1_TRIG15_PIO1_4
#undef DMA1_TRIG15_PIO1_5
#undef DMA1_TRIG15_PIO1_6
#undef DMA1_TRIG15_PIO1_7
#undef DMA1_TRIG15_PIO1_8
#undef DMA1_TRIG15_PIO1_9
#undef DMA1_TRIG16_PIO1_10
#undef DMA1_TRIG16_PIO1_11
#undef DMA1_TRIG16_PIO1_12
#undef DMA1_TRIG16_PIO1_13
#undef DMA1_TRIG16_PIO1_14
#undef DMA1_TRIG16_PIO1_15
#undef DMA1_TRIG16_PIO1_16
#undef DMA1_TRIG16_PIO1_17
#undef DMA1_TRIG16_PIO1_18
#undef DMA1_TRIG16_PIO1_19
#undef DMA1_TRIG16_PIO1_20
#undef DMA1_TRIG16_PIO1_21
#undef DMA1_TRIG16_PIO1_22
#undef DMA1_TRIG16_PIO1_23
#undef DMA1_TRIG16_PIO1_24
#undef DMA1_TRIG16_PIO1_25
#undef DMA1_TRIG16_PIO1_26
#undef DMA1_TRIG16_PIO1_27
#undef DMA1_TRIG16_PIO1_28
#undef DMA1_TRIG16_PIO1_29
#undef DMA1_TRIG16_PIO1_30
#undef DMA1_TRIG16_PIO1_31
#undef DMA1_TRIG16_PIO1_4
#undef DMA1_TRIG16_PIO1_5
#undef DMA1_TRIG16_PIO1_6
#undef DMA1_TRIG16_PIO1_7
#undef DMA1_TRIG16_PIO1_8
#undef DMA1_TRIG16_PIO1_9
#undef DMA1_TRIG17_PIO1_10
#undef DMA1_TRIG17_PIO1_11
#undef DMA1_TRIG17_PIO1_12
#undef DMA1_TRIG17_PIO1_13
#undef DMA1_TRIG17_PIO1_14
#undef DMA1_TRIG17_PIO1_15
#undef DMA1_TRIG17_PIO1_16
#undef DMA1_TRIG17_PIO1_17
#undef DMA1_TRIG17_PIO1_18
#undef DMA1_TRIG17_PIO1_19
#undef DMA1_TRIG17_PIO1_20
#undef DMA1_TRIG17_PIO1_21
#undef DMA1_TRIG17_PIO1_22
#undef DMA1_TRIG17_PIO1_23
#undef DMA1_TRIG17_PIO1_24
#undef DMA1_TRIG17_PIO1_25
#undef DMA1_TRIG17_PIO1_26
#undef DMA1_TRIG17_PIO1_27
#undef DMA1_TRIG17_PIO1_28
#undef DMA1_TRIG17_PIO1_29
#undef DMA1_TRIG17_PIO1_30
#undef DMA1_TRIG17_PIO1_31
#undef DMA1_TRIG17_PIO1_4
#undef DMA1_TRIG17_PIO1_5
#undef DMA1_TRIG17_PIO1_6
#undef DMA1_TRIG17_PIO1_7
#undef DMA1_TRIG17_PIO1_8
#undef DMA1_TRIG17_PIO1_9
#undef DMA1_TRIG18_PIO1_10
#undef DMA1_TRIG18_PIO1_11
#undef DMA1_TRIG18_PIO1_12
#undef DMA1_TRIG18_PIO1_13
#undef DMA1_TRIG18_PIO1_14
#undef DMA1_TRIG18_PIO1_15
#undef DMA1_TRIG18_PIO1_16
#undef DMA1_TRIG18_PIO1_17
#undef DMA1_TRIG18_PIO1_18
#undef DMA1_TRIG18_PIO1_19
#undef DMA1_TRIG18_PIO1_20
#undef DMA1_TRIG18_PIO1_21
#undef DMA1_TRIG18_PIO1_22
#undef DMA1_TRIG18_PIO1_23
#undef DMA1_TRIG18_PIO1_24
#undef DMA1_TRIG18_PIO1_25
#undef DMA1_TRIG18_PIO1_26
#undef DMA1_TRIG18_PIO1_27
#undef DMA1_TRIG18_PIO1_28
#undef DMA1_TRIG18_PIO1_29
#undef DMA1_TRIG18_PIO1_30
#undef DMA1_TRIG18_PIO1_31
#undef DMA1_TRIG18_PIO1_4
#undef DMA1_TRIG18_PIO1_5
#undef DMA1_TRIG18_PIO1_6
#undef DMA1_TRIG18_PIO1_7
#undef DMA1_TRIG18_PIO1_8
#undef DMA1_TRIG18_PIO1_9
#undef DMA1_TRIG19_PIO1_10
#undef DMA1_TRIG19_PIO1_11
#undef DMA1_TRIG19_PIO1_12
#undef DMA1_TRIG19_PIO1_13
#undef DMA1_TRIG19_PIO1_14
#undef DMA1_TRIG19_PIO1_15
#undef DMA1_TRIG19_PIO1_16
#undef DMA1_TRIG19_PIO1_17
#undef DMA1_TRIG19_PIO1_18
#undef DMA1_TRIG19_PIO1_19
#undef DMA1_TRIG19_PIO1_20
#undef DMA1_TRIG19_PIO1_21
#undef DMA1_TRIG19_PIO1_22
#undef DMA1_TRIG19_PIO1_23
#undef DMA1_TRIG19_PIO1_24
#undef DMA1_TRIG19_PIO1_25
#undef DMA1_TRIG19_PIO1_26
#undef DMA1_TRIG19_PIO1_27
#undef DMA1_TRIG19_PIO1_28
#undef DMA1_TRIG19_PIO1_29
#undef DMA1_TRIG19_PIO1_30
#undef DMA1_TRIG19_PIO1_31
#undef DMA1_TRIG19_PIO1_4
#undef DMA1_TRIG19_PIO1_5
#undef DMA1_TRIG19_PIO1_6
#undef DMA1_TRIG19_PIO1_7
#undef DMA1_TRIG19_PIO1_8
#undef DMA1_TRIG19_PIO1_9
#undef FC0_CTS_SDA_SSEL0_PIO1_8
#undef FC0_RTS_SCL_SSEL1_PIO1_7
#undef FC0_RXD_SDA_MOSI_DATA_PIO1_5
#undef FC0_SCK_PIO1_4
#undef FC0_TXD_SCL_MISO_WS_PIO1_6
#undef FC1_RXD_SDA_MOSI_DATA_PIO1_10
#undef FC1_SCK_PIO1_9
#undef FC1_TXD_SCL_MISO_WS_PIO1_11
#undef FC2_CTS_SDA_SSEL0_PIO1_26
#undef FC2_RTS_SCL_SSEL1_PIO1_27
#undef FC2_RXD_SDA_MOSI_DATA_PIO1_24
#undef FC2_SCK_PIO1_23
#undef FC2_TXD_SCL_MISO_WS_PIO1_25
#undef FC3_SSEL2_PIO1_23
#undef FC3_SSEL3_PIO1_24
#undef FC4_CTS_SDA_SSEL0_PIO1_9
#undef FC4_RTS_SCL_SSEL1_PIO1_15
#undef FC4_RXD_SDA_MOSI_DATA_PIO1_21
#undef FC4_SCK_PIO1_19
#undef FC4_SSEL2_PIO1_8
#undef FC4_SSEL3_PIO1_22
#undef FC4_TXD_SCL_MISO_WS_PIO1_20
#undef FC5_CTS_SDA_SSEL0_PIO1_14
#undef FC5_RTS_SCL_SSEL1_PIO1_15
#undef FC6_RTS_SCL_SSEL1_PIO1_17
#undef FC6_RXD_SDA_MOSI_DATA_PIO1_13
#undef FC6_SCK_PIO1_12
#undef FC6_TXD_SCL_MISO_WS_PIO1_16
#undef FC7_CTS_SDA_SSEL0_PIO1_21
#undef FC7_RTS_SCL_SSEL1_PIO1_20
#undef FC7_RXD_SDA_MOSI_DATA_PIO1_29
#undef FC7_SCK_PIO1_28
#undef FC7_TXD_SCL_MISO_WS_PIO1_30
#undef GPIO_PIO110_PIO1_10
#undef GPIO_PIO111_PIO1_11
#undef GPIO_PIO112_PIO1_12
#undef GPIO_PIO113_PIO1_13
#undef GPIO_PIO114_PIO1_14
#undef GPIO_PIO115_PIO1_15
#undef GPIO_PIO116_PIO1_16
#undef GPIO_PIO117_PIO1_17
#undef GPIO_PIO118_PIO1_18
#undef GPIO_PIO119_PIO1_19
#undef GPIO_PIO120_PIO1_20
#undef GPIO_PIO121_PIO1_21
#undef GPIO_PIO122_PIO1_22
#undef GPIO_PIO123_PIO1_23
#undef GPIO_PIO124_PIO1_24
#undef GPIO_PIO125_PIO1_25
#undef GPIO_PIO126_PIO1_26
#undef GPIO_PIO127_PIO1_27
#undef GPIO_PIO128_PIO1_28
#undef GPIO_PIO129_PIO1_29
#undef GPIO_PIO130_PIO1_30
#undef GPIO_PIO131_PIO1_31
#undef GPIO_PIO14_PIO1_4
#undef GPIO_PIO15_PIO1_5
#undef GPIO_PIO16_PIO1_6
#undef GPIO_PIO17_PIO1_7
#undef GPIO_PIO18_PIO1_8
#undef GPIO_PIO19_PIO1_9
#undef HS_SPI_SSEL2_PIO1_12
#undef HS_SPI_SSEL3_PIO1_26
#undef MCLK_PIO1_31
#undef PINT_PINT0_PIO1_10
#undef PINT_PINT0_PIO1_11
#undef PINT_PINT0_PIO1_12
#undef PINT_PINT0_PIO1_13
#undef PINT_PINT0_PIO1_14
#undef PINT_PINT0_PIO1_15
#undef PINT_PINT0_PIO1_16
#undef PINT_PINT0_PIO1_17
#undef PINT_PINT0_PIO1_18
#undef PINT_PINT0_PIO1_19
#undef PINT_PINT0_PIO1_20
#undef PINT_PINT0_PIO1_21
#undef PINT_PINT0_PIO1_22
#undef PINT_PINT0_PIO1_23
#undef PINT_PINT0_PIO1_24
#undef PINT_PINT0_PIO1_25
#undef PINT_PINT0_PIO1_26
#undef PINT_PINT0_PIO1_27
#undef PINT_PINT0_PIO1_28
#undef PINT_PINT0_PIO1_29
#undef PINT_PINT0_PIO1_30
#undef PINT_PINT0_PIO1_31
#undef PINT_PINT0_PIO1_4
#undef PINT_PINT0_PIO1_5
#undef PINT_PINT0_PIO1_6
#undef PINT_PINT0_PIO1_7
#undef PINT_PINT0_PIO1_8
#undef PINT_PINT0_PIO1_9
#undef PINT_PINT1_PIO1_10
#undef PINT_PINT1_PIO1_11
#undef PINT_PINT1_PIO1_12
#undef PINT_PINT1_PIO1_13
#undef PINT_PINT1_PIO1_14
#undef PINT_PINT1_PIO1_15
#undef PINT_PINT1_PIO1_16
#undef PINT_PINT1_PIO1_17
#undef PINT_PINT1_PIO1_18
#undef PINT_PINT1_PIO1_19
#undef PINT_PINT1_PIO1_20
#undef PINT_PINT1_PIO1_21
#undef PINT_PINT1_PIO1_22
#undef PINT_PINT1_PIO1_23
#undef PINT_PINT1_PIO1_24
#undef PINT_PINT1_PIO1_25
#undef PINT_PINT1_PIO1_26
#undef PINT_PINT1_PIO1_27
#undef PINT_PINT1_PIO1_28
#undef PINT_PINT1_PIO1_29
#undef PINT_PINT1_PIO1_30
#undef PINT_PINT1_PIO1_31
#undef PINT_PINT1_PIO1_4
#undef PINT_PINT1_PIO1_5
#undef PINT_PINT1_PIO1_6
#undef PINT_PINT1_PIO1_7
#undef PINT_PINT1_PIO1_8
#undef PINT_PINT1_PIO1_9
#undef PINT_PINT2_PIO1_10
#undef PINT_PINT2_PIO1_11
#undef PINT_PINT2_PIO1_12
#undef PINT_PINT2_PIO1_13
#undef PINT_PINT2_PIO1_14
#undef PINT_PINT2_PIO1_15
#undef PINT_PINT2_PIO1_16
#undef PINT_PINT2_PIO1_17
#undef PINT_PINT2_PIO1_18
#undef PINT_PINT2_PIO1_19
#undef PINT_PINT2_PIO1_20
#undef PINT_PINT2_PIO1_21
#undef PINT_PINT2_PIO1_22
#undef PINT_PINT2_PIO1_23
#undef PINT_PINT2_PIO1_24
#undef PINT_PINT2_PIO1_25
#undef PINT_PINT2_PIO1_26
#undef PINT_PINT2_PIO1_27
#undef PINT_PINT2_PIO1_28
#undef PINT_PINT2_PIO1_29
#undef PINT_PINT2_PIO1_30
#undef PINT_PINT2_PIO1_31
#undef PINT_PINT2_PIO1_4
#undef PINT_PINT2_PIO1_5
#undef PINT_PINT2_PIO1_6
#undef PINT_PINT2_PIO1_7
#undef PINT_PINT2_PIO1_8
#undef PINT_PINT2_PIO1_9
#undef PINT_PINT3_PIO1_10
#undef PINT_PINT3_PIO1_11
#undef PINT_PINT3_PIO1_12
#undef PINT_PINT3_PIO1_13
#undef PINT_PINT3_PIO1_14
#undef PINT_PINT3_PIO1_15
#undef PINT_PINT3_PIO1_16
#undef PINT_PINT3_PIO1_17
#undef PINT_PINT3_PIO1_18
#undef PINT_PINT3_PIO1_19
#undef PINT_PINT3_PIO1_20
#undef PINT_PINT3_PIO1_21
#undef PINT_PINT3_PIO1_22
#undef PINT_PINT3_PIO1_23
#undef PINT_PINT3_PIO1_24
#undef PINT_PINT3_PIO1_25
#undef PINT_PINT3_PIO1_26
#undef PINT_PINT3_PIO1_27
#undef PINT_PINT3_PIO1_28
#undef PINT_PINT3_PIO1_29
#undef PINT_PINT3_PIO1_30
#undef PINT_PINT3_PIO1_31
#undef PINT_PINT3_PIO1_4
#undef PINT_PINT3_PIO1_5
#undef PINT_PINT3_PIO1_6
#undef PINT_PINT3_PIO1_7
#undef PINT_PINT3_PIO1_8
#undef PINT_PINT3_PIO1_9
#undef PINT_PINT4_PIO1_10
#undef PINT_PINT4_PIO1_11
#undef PINT_PINT4_PIO1_12
#undef PINT_PINT4_PIO1_13
#undef PINT_PINT4_PIO1_14
#undef PINT_PINT4_PIO1_15
#undef PINT_PINT4_PIO1_16
#undef PINT_PINT4_PIO1_17
#undef PINT_PINT4_PIO1_18
#undef PINT_PINT4_PIO1_19
#undef PINT_PINT4_PIO1_20
#undef PINT_PINT4_PIO1_21
#undef PINT_PINT4_PIO1_22
#undef PINT_PINT4_PIO1_23
#undef PINT_PINT4_PIO1_24
#undef PINT_PINT4_PIO1_25
#undef PINT_PINT4_PIO1_26
#undef PINT_PINT4_PIO1_27
#undef PINT_PINT4_PIO1_28
#undef PINT_PINT4_PIO1_29
#undef PINT_PINT4_PIO1_30
#undef PINT_PINT4_PIO1_31
#undef PINT_PINT4_PIO1_4
#undef PINT_PINT4_PIO1_5
#undef PINT_PINT4_PIO1_6
#undef PINT_PINT4_PIO1_7
#undef PINT_PINT4_PIO1_8
#undef PINT_PINT4_PIO1_9
#undef PINT_PINT5_PIO1_10
#undef PINT_PINT5_PIO1_11
#undef PINT_PINT5_PIO1_12
#undef PINT_PINT5_PIO1_13
#undef PINT_PINT5_PIO1_14
#undef PINT_PINT5_PIO1_15
#undef PINT_PINT5_PIO1_16
#undef PINT_PINT5_PIO1_17
#undef PINT_PINT5_PIO1_18
#undef PINT_PINT5_PIO1_19
#undef PINT_PINT5_PIO1_20
#undef PINT_PINT5_PIO1_21
#undef PINT_PINT5_PIO1_22
#undef PINT_PINT5_PIO1_23
#undef PINT_PINT5_PIO1_24
#undef PINT_PINT5_PIO1_25
#undef PINT_PINT5_PIO1_26
#undef PINT_PINT5_PIO1_27
#undef PINT_PINT5_PIO1_28
#undef PINT_PINT5_PIO1_29
#undef PINT_PINT5_PIO1_30
#undef PINT_PINT5_PIO1_31
#undef PINT_PINT5_PIO1_4
#undef PINT_PINT5_PIO1_5
#undef PINT_PINT5_PIO1_6
#undef PINT_PINT5_PIO1_7
#undef PINT_PINT5_PIO1_8
#undef PINT_PINT5_PIO1_9
#undef PINT_PINT6_PIO1_10
#undef PINT_PINT6_PIO1_11
#undef PINT_PINT6_PIO1_12
#undef PINT_PINT6_PIO1_13
#undef PINT_PINT6_PIO1_14
#undef PINT_PINT6_PIO1_15
#undef PINT_PINT6_PIO1_16
#undef PINT_PINT6_PIO1_17
#undef PINT_PINT6_PIO1_18
#undef PINT_PINT6_PIO1_19
#undef PINT_PINT6_PIO1_20
#undef PINT_PINT6_PIO1_21
#undef PINT_PINT6_PIO1_22
#undef PINT_PINT6_PIO1_23
#undef PINT_PINT6_PIO1_24
#undef PINT_PINT6_PIO1_25
#undef PINT_PINT6_PIO1_26
#undef PINT_PINT6_PIO1_27
#undef PINT_PINT6_PIO1_28
#undef PINT_PINT6_PIO1_29
#undef PINT_PINT6_PIO1_30
#undef PINT_PINT6_PIO1_31
#undef PINT_PINT6_PIO1_4
#undef PINT_PINT6_PIO1_5
#undef PINT_PINT6_PIO1_6
#undef PINT_PINT6_PIO1_7
#undef PINT_PINT6_PIO1_8
#undef PINT_PINT6_PIO1_9
#undef PINT_PINT7_PIO1_10
#undef PINT_PINT7_PIO1_11
#undef PINT_PINT7_PIO1_12
#undef PINT_PINT7_PIO1_13
#undef PINT_PINT7_PIO1_14
#undef PINT_PINT7_PIO1_15
#undef PINT_PINT7_PIO1_16
#undef PINT_PINT7_PIO1_17
#undef PINT_PINT7_PIO1_18
#undef PINT_PINT7_PIO1_19
#undef PINT_PINT7_PIO1_20
#undef PINT_PINT7_PIO1_21
#undef PINT_PINT7_PIO1_22
#undef PINT_PINT7_PIO1_23
#undef PINT_PINT7_PIO1_24
#undef PINT_PINT7_PIO1_25
#undef PINT_PINT7_PIO1_26
#undef PINT_PINT7_PIO1_27
#undef PINT_PINT7_PIO1_28
#undef PINT_PINT7_PIO1_29
#undef PINT_PINT7_PIO1_30
#undef PINT_PINT7_PIO1_31
#undef PINT_PINT7_PIO1_4
#undef PINT_PINT7_PIO1_5
#undef PINT_PINT7_PIO1_6
#undef PINT_PINT7_PIO1_7
#undef PINT_PINT7_PIO1_8
#undef PINT_PINT7_PIO1_9
#undef PLU_CLKIN_PIO1_25
#undef PLU_INPUT0_PIO1_31
#undef PLU_INPUT1_PIO1_30
#undef PLU_INPUT2_PIO1_29
#undef PLU_INPUT3_PIO1_28
#undef PLU_INPUT4_PIO1_27
#undef PLU_INPUT5_PIO1_26
#undef PLU_OUT0_PIO1_18
#undef PLU_OUT1_PIO1_19
#undef PLU_OUT2_PIO1_20
#undef PLU_OUT3_PIO1_21
#undef PLU_OUT4_PIO1_22
#undef PLU_OUT5_PIO1_23
#undef PLU_OUT6_PIO1_24
#undef PMC_ACMP_IN4_PIO1_14
#undef SCT0_IN0_PIO1_19
#undef SCT0_IN0_PIO1_22
#undef SCT0_IN0_PIO1_29
#undef SCT0_IN0_PIO1_30
#undef SCT0_IN0_PIO1_5
#undef SCT0_IN0_PIO1_6
#undef SCT0_IN0_PIO1_7
#undef SCT0_IN1_PIO1_19
#undef SCT0_IN1_PIO1_22
#undef SCT0_IN1_PIO1_29
#undef SCT0_IN1_PIO1_30
#undef SCT0_IN1_PIO1_5
#undef SCT0_IN1_PIO1_6
#undef SCT0_IN1_PIO1_7
#undef SCT0_IN2_PIO1_19
#undef SCT0_IN2_PIO1_22
#undef SCT0_IN2_PIO1_29
#undef SCT0_IN2_PIO1_30
#undef SCT0_IN2_PIO1_5
#undef SCT0_IN2_PIO1_6
#undef SCT0_IN2_PIO1_7
#undef SCT0_IN3_PIO1_19
#undef SCT0_IN3_PIO1_22
#undef SCT0_IN3_PIO1_29
#undef SCT0_IN3_PIO1_30
#undef SCT0_IN3_PIO1_5
#undef SCT0_IN3_PIO1_6
#undef SCT0_IN3_PIO1_7
#undef SCT0_IN4_PIO1_19
#undef SCT0_IN4_PIO1_22
#undef SCT0_IN4_PIO1_29
#undef SCT0_IN4_PIO1_30
#undef SCT0_IN4_PIO1_5
#undef SCT0_IN4_PIO1_6
#undef SCT0_IN4_PIO1_7
#undef SCT0_IN5_PIO1_19
#undef SCT0_IN5_PIO1_22
#undef SCT0_IN5_PIO1_29
#undef SCT0_IN5_PIO1_30
#undef SCT0_IN5_PIO1_5
#undef SCT0_IN5_PIO1_6
#undef SCT0_IN5_PIO1_7
#undef SCT0_IN6_PIO1_19
#undef SCT0_IN6_PIO1_22
#undef SCT0_IN6_PIO1_29
#undef SCT0_IN6_PIO1_30
#undef SCT0_IN6_PIO1_5
#undef SCT0_IN6_PIO1_6
#undef SCT0_IN6_PIO1_7
#undef SCT0_OUT0_PIO1_23
#undef SCT0_OUT0_PIO1_4
#undef SCT0_OUT1_PIO1_24
#undef SCT0_OUT1_PIO1_8
#undef SCT0_OUT2_PIO1_25
#undef SCT0_OUT2_PIO1_9
#undef SCT0_OUT3_PIO1_10
#undef SCT0_OUT3_PIO1_26
#undef SCT0_OUT4_PIO1_17
#undef SCT0_OUT5_PIO1_18
#undef SCT0_OUT6_PIO1_31
#undef SCT0_OUT7_PIO1_19
#undef SD0_CARD_DET_N_PIO0_17
#undef SD0_CARD_DET_N_PIO1_13
#undef SD0_CARD_INT_N_PIO0_17
#undef SD0_CLK_PIO0_7
#undef SD0_CLK_PIO1_8
#undef SD0_CMD_PIO0_8
#undef SD0_CMD_PIO1_16
#undef SD0_CMD_PIO1_22
#undef SD0_POW_EN_PIO0_12
#undef SD0_POW_EN_PIO0_9
#undef SD0_WR_PRT_PIO0_15
#undef SD0_WR_PRT_PIO0_18
#undef SD1_BACKEND_PWR_PIO0_12
#undef SD1_CARD_DET_N_PIO1_17
#undef SD1_CARD_INT_N_PIO0_0
#undef SD1_CARD_INT_N_PIO1_17
#undef SD1_CLK_PIO0_1
#undef SD1_CLK_PIO1_31
#undef SD1_CMD_PIO0_28
#undef SD1_CMD_PIO1_14
#undef SD1_POW_EN_PIO1_18
#undef SDIF_SD0_D0_PIO0_24
#undef SDIF_SD0_D0_PIO1_4
#undef SDIF_SD0_D1_PIO0_25
#undef SDIF_SD0_D1_PIO1_7
#undef SDIF_SD0_D2_PIO0_31
#undef SDIF_SD0_D2_PIO1_5
#undef SDIF_SD0_D3_PIO1_0
#undef SDIF_SD0_D3_PIO1_6
#undef SDIF_SD0_D4_PIO1_27
#undef SDIF_SD0_D5_PIO1_28
#undef SDIF_SD0_D6_PIO1_29
#undef SDIF_SD0_D7_PIO1_30
#undef SDIF_SD1_D0_PIO0_22
#undef SDIF_SD1_D0_PIO1_25
#undef SDIF_SD1_D1_PIO0_23
#undef SDIF_SD1_D1_PIO1_24
#undef SDIF_SD1_D2_PIO0_29
#undef SDIF_SD1_D2_PIO1_15
#undef SDIF_SD1_D3_PIO0_30
#undef SDIF_SD1_D3_PIO1_23
#undef SYSCON_FREQMEA_PIO1_4
#undef USB0_FRAME_PIO1_13
#undef USB0_LEDN_PIO1_14
#undef USB0_OVERCURRENTN_PIO1_13
#undef USB0_PORTPWRN_PIO1_12
#undef USB0_VBUS_PIO1_11
#undef USB1_FRAME_PIO1_29
#undef USB1_LEDN_PIO1_30
#undef USB1_OVERCURRENTN_PIO1_1
#undef USB1_OVERCURRENTN_PIO1_30
#undef USB1_PORTPWRN_PIO1_2
#undef USB1_PORTPWRN_PIO1_29
#undef UTICK0_CAPTURE0_PIO1_25
#undef UTICK0_CAPTURE1_PIO1_26
#undef UTICK0_CAPTURE2_PIO1_14
#undef UTICK0_CAPTURE3_PIO1_15

/* Signals specific to this part */
#define CAN0_RD_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 1)
#define CAN0_RD_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 1)
#define CAN0_TD_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 1)
#define CAN0_TD_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 1)
#define HS_SPI_SSEL3_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 8)

#endif /* _ZEPHYR_DTS_BINDING_LPC5512JBD64_WRAPPER_ */
